# Data Analyst with Python Project

# Exploring NYC Public School Test Results Scores

## <span style="color:red;"> Project Instructions</span>

Which NYC schools have the best math results?

- The best math results are at least 80% of the ***maximum possible score of 800* for math**.
- Save your results in a pandas DataFrame called `best_math_schools`, including `"school_name"` and `"average_math"` columns, sorted by `"average_math"` in descending order.

What are the top 10 performing schools based on the combined SAT scores?

- Save your results as a pandas DataFrame called `top_10_schools` containing the `"school_name"` and a new column named `"total_SAT"`, with results ordered by `"total_SAT"` in descending order.

Which single borough has the largest standard deviation in the combined SAT score?

- Save your results as a pandas DataFrame called largest_std_dev.
- The DataFrame should contain one row, with:

> 1) `"borough"` - the name of the NYC borough with the largest standard deviation of `"total_SAT"`.
> 2) `"num_schools"` - thenumber of schools in the borough.
> 3) `"average_SAT"` - the mean of "total_SAT".
> 4) `"std_SAT"` - the standard deviation of "total_SAT".
- Round all numeric values to two decimal places.

Every year, American high school students take SATs, which are standardized tests intended to measure literacy, numeracy, and writing skills. There are three sections - reading, math, and writing, each with a **maximum score of 800 points**. These tests are extremely important for students and colleges, as they play a pivotal role in the admissions process.

Analyzing the performance of schools is important for a variety of stakeholders, including policy and education professionals, researchers, government, and even parents considering which school their children should attend. 

You have been provided with a dataset called `schools.csv`, which is previewed below.

You have been tasked with answering three key questions about New York City (NYC) public school SAT performance.

In [34]:
# Re-run this cell 
import pandas as pd

# Read in the data
schools = pd.read_csv(r"C:\Users\wende\Desktop\DataCamp\Data Analyst with Python\5 Exploring NYC Public School Test Results Scores\workspace\schools.csv")

# Preview the data
schools.head()

# Start coding here...

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7

### Part A

In [41]:
#80% of 800
eighty_pct = 0.8*800
eighty_pct

640.0

In [47]:
#sorting 80% of best maths

maths=schools[schools["average_math"] >= eighty_pct]
maths.head()

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
45,Eleanor Roosevelt High School,Manhattan,M855,641,617,631,86.0
68,"High School for Mathematics, Science, and Engi...",Manhattan,M812,683,610,596,92.6
88,Stuyvesant High School,Manhattan,M477,754,697,693,97.4
93,Staten Island Technical High School,Staten Island,R440,711,660,670,99.7

##### <span style="color:blue;"> Testing start</span>

In [74]:
maths["average_math"].sort_values()

45     641
0      657
174    669
333    680
280    682
68     683
365    701
93     711
170    714
88     754
Name: average_math, dtype: int64

##### <span style="color:blue;"> Testing end</span>

**Since we are selecting 2 columns from maths df, sort_values requires `by` argument. E.g by="average_math".**

In [91]:
#sorting best schools from maths
best_math_schools = maths[["school_name","average_math"]].sort_values(by="average_math",ascending=False)
best_math_schools.head()

                                           school_name  average_math
88                              Stuyvesant High School           754
170                       Bronx High School of Science           714
93                 Staten Island Technical High School           711
365  Queens High School for the Sciences at York Co...           701
68   High School for Mathematics, Science, and Engi...           683

### Part B

##### <span style="color:green;"> Total SAT: </span>
maths + reading + writing

In [106]:
#creating a new column name Total_SAT
schools["total_SAT"] = schools["average_math"] + schools["average_reading"] + schools["average_writing"]
schools.head()

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested,Total_SAT,total_SAT
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN,1859,1859
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9,1193,1193
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1,1261,1261
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9,1529,1529
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7,1197,1197

In [114]:
top_10_schools = schools[["school_name","total_SAT"]].sort_values(by="total_SAT",ascending=False)
top_10_schools.head(10)

                                           school_name  total_SAT
88                              Stuyvesant High School       2144
170                       Bronx High School of Science       2041
93                 Staten Island Technical High School       2041
174  High School of American Studies at Lehman College       2013
333                        Townsend Harris High School       1981
365  Queens High School for the Sciences at York Co...       1947
5                       Bard High School Early College       1914
280                     Brooklyn Technical High School       1896
45                       Eleanor Roosevelt High School       1889
68   High School for Mathematics, Science, and Engi...       1889

### Part C

##### <span style="color:blue;"> Testing start</span>

**to calculate count,std,mean in `1 single line` use agg(). eg agg(["count","mean","std"])** `Do note the [ ] for multiple selection in agg ( )`

In [132]:
schools["total_SAT"].agg(["count","mean","std"])

count     375.000000
mean     1275.906667
std       194.906283
Name: total_SAT, dtype: float64

**To see how repeated names in borough columns**

In [176]:
schools["borough"].value_counts()

borough
Brooklyn         109
Bronx             98
Manhattan         89
Queens            69
Staten Island     10
Name: count, dtype: int64

##### <span style="color:blue;"> Testing end</span>

### <i>.groupby()</i>

A groupby operation involves some combination of splitting the object, applying a function, and combining the results. This can be used to group large amounts of data and compute operations on these groups.

In [162]:
#grouping by borough with total_sat
boroughs = schools.groupby("borough")["total_SAT"].agg(["count","mean","std"]).round(2)
boroughs

               count     mean     std
borough
Bronx             98  1202.72  150.39
Brooklyn         109  1230.26  154.87
Manhattan         89  1340.13  230.29
Queens            69  1345.48  195.25
Staten Island     10  1439.00  222.30

##### <span style="color:magenta;"> Code explanation</span>

- using groupby("borough"), the borough will be the `index`
- then `.agg(["count","mean","std"])` calculations will be performed on total_SAT columns

In [238]:
## sorting std in boroughs df in descending order

max_borough_std = boroughs[["count","mean","std"]].sort_values(by="std",ascending=False)
max_borough_std

               count     mean     std
borough
Manhattan         89  1340.13  230.29
Staten Island     10  1439.00  222.30
Queens            69  1345.48  195.25
Brooklyn         109  1230.26  154.87
Bronx             98  1202.72  150.39

In [260]:
max_borough_std = max_borough_std.rename(columns={"count":"num_schools", "mean":"average_SAT", "std":"std_SAT"})
#max_borough_std.reset_index(inplace=True)
max_borough_std.head()

               num_schools  average_SAT  std_SAT
borough
Manhattan               89      1340.13   230.29
Staten Island           10      1439.00   230.29
Queens                  69      1345.48   230.29
Brooklyn               109      1230.26   230.29
Bronx                   98      1202.72   230.29

**Ans is Manhattan**

### Alternative answer to show only the max std in df

In [270]:
value = boroughs["std"].max()
largest_std_dev = boroughs[boroughs["std"] == value ] 
largest_std_dev = largest_std_dev.rename(columns={"count":"num_schools", "mean":"average_SAT", "std":"std_SAT"})
largest_std_dev.reset_index(inplace=True)
largest_std_dev.head()

     borough  num_schools  average_SAT  std_SAT
0  Manhattan           89      1340.13   230.29

## <span style="color:red;"> DataCamp solution</span>

In [32]:
# Start coding here...

#Which NYC schools have the best math results?
best_math_schools = schools[schools["average_math"]>=640][["school_name","average_math"]].sort_values("average_math",ascending=False)

#What are the top 10 performing schools based on the combined SAT scores?
schools["total_SAT"] = schools["average_math"] + schools["average_reading"] + schools["average_writing"]
top_10_schools = schools[["school_name","total_SAT"]].sort_values("total_SAT",ascending=False).head(10)

#Which single borough has the largest standard deviation in the combined SAT score?
boroughs = schools.groupby("borough")["total_SAT"].agg(["count","mean","std"]).round(2)
value = boroughs["std"].max()
largest_std_dev = boroughs[boroughs["std"] == value ] 
largest_std_dev = largest_std_dev.rename(columns={"count":"num_schools", "mean":"average_SAT", "std":"std_SAT"})
largest_std_dev.reset_index(inplace=True)
largest_std_dev.head()

#Add as many cells as you like...

     borough  num_schools  average_SAT  std_SAT
0  Manhattan           89      1340.13   230.29